In [1]:
import mysql.connector
import pandas as pd

In [2]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'retrowheels'
)

In [3]:
mycursor = mydb.cursor()

query = 'select * from employees'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head(5)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

In [4]:
mycursor = mydb.cursor()

query = 'show tables'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

  Tables_in_retrowheels
0             customers
1             employees
2               offices
3          orderdetails
4                orders
5              payments
6          productlines
7              products

Soal No. 1

In [8]:
mycursor = mydb.cursor()

query = 'select o.city, count(e.employeeNumber) from offices o inner join employees e using(officeCode) group by o.city order by e.employeeNumber '

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

            city  count(e.employeeNumber)
0  San Francisco                        6
1         Sydney                        4
2          Paris                        5
3         Boston                        2
4            NYC                        2
5         London                        2
6          Tokyo                        2

Soal No. 2

In [9]:
mycursor = mydb.cursor()

query = 'select (select count(distinct productLine) from productlines), (select count(productCode) from products)'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

,(select count(distinct productLine) from productlines),(select count(productCode) from products)
0,7,110